QUESTIONS = [
    # Информация об артисте
    "расскажи про ARTISTNAME",
    "информация про ARTISTNAME",

    # Поиск
    ## 1. похожие на артиста"
    "найди похожих исполнителей на ARTISTNAME",
    "найди похожих на ARTISTNAME",
    "похожие на ARTISTNAME",
    ## 3. поиск исполнителей по жанру"
    "найди исполнителей в жанре GENRENAME",
    "исполнители в жанре GENRENAME",
    ## 5. показ исполнителей-мужчин"
    "покажи исполнителей мужчин",
    "артисты мужчины",
    ## 6. показ исполнителей-женщин"
    "покажи исполнителей женщин",
    "артисты женщины",
    ## 7. показ исполнителей определенного пола",
    "покажи исполнителей SEX пола",
    "исполнители SEX пола",

    # Фильтры (применяются к выборке)
    ## 8. убрать всех, кроме исполнителей определенного пола"
    "оставь исполнителей SEX пола",
    "убери всех исполнителей кроме SEX пола",
    ## 13. убрать всех, кроме соло"
    "оставь только соло исполнителей",
    "убери всех кроме соло исполнителей",
    ## 14. убрать всех, кроме дуэтов"
    "оставь только дуэты",
    "убери всех кроме дуэтов",
    ## 15. убрать всех, кроме групп"
    "оставь только группы",
    "убери всех кроме групп",
    ## 16. убрать исполнителей младше чем"
    "убери исполнителей младше чем AGE",
    "оставь исполнителей старше чем AGE",
    ## 17. убрать исполнителей старше чем"
    "убери исполнителей старше чем AGE",
    "оставь исполнителей младше чем AGE",
    ## 18. фильтр по возрасту от MINAGE до MAXAGE"
    "оставь исполнителей в возрасте от MINAGE до MAXAGE",
    ## 19. фильтр количества результатов"
    "показывай по N артистов",
    "выводи по N артистов",
    ## 20. убрать фильтр количества результатов"
    "убери ограничение на количество артистов",
    "выводи всех отфильтрованных",

    # Лайки дизлайки
    ## 21. поставить дизлайк"
    "мне не нравится ARTISTNAME",
    "поставь дизлайк ARTISTNAME",
    "добавь ARTISTNAME в список дизлайков",
    ## 22. убрать дизлайк"
    "убери ARTISTNAME из списка дизлайков",
    ## 23. поставить лайк"
    "мне нравится ARTISTNAME",
    "мне нравится исполнитель ARTISTNAME",
    "добавь ARTISTNAME в список любимых",
    "поставь лайк ARTISTNAME",
    ## 24. убрать лайк"
    "мне больше не нравится ARTISTNAME",
    "убери ARTISTNAME из списка лайков",

    # Общее
    ## 25. количество артистов в базе"
    "сколько исполнителей в базе?",
    "сколько исполнителей ты знаешь?",
    ## 26. количество артистов-мужчин в базе"
    "сколько мужчин в базе?",
    "сколько исполнителей мужчин ты знаешь?",
    ## 27. количество артистов-женщин в базе"
    "сколько женщин в базе?",
    "сколько исполнителей женщин ты знаешь?",
    ## 28. количество исполнителей старше AGE лет"
    "сколько ты знаешь исполнителей старше AGE лет?",
    "сколько исполнителей старше AGE лет?",
    ## 29. количество исполнителей младше AGE лет"
    "сколько ты знаешь исполнителей младше AGE лет?",
    "сколько исполнителей младше AGE лет?",
    ## 30. в начало"
    "вернись в начало",
    "в начало",
    # Список всех артистов
    "покажи всех исполнителей",
    "все артисты",
]